.outdated/shared/output-old/output-15-2025-10-23-08-10-44/k6-test-amd.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

time="2025-10-23T08:10:44+02:00" level=info msg="Loaded 50 users for tenant amd" source=console
     execution: local
        script: /Users/urosceh/Code/zilla-minikube/shared/k6-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 3m30s max duration (incl. graceful stop):
              * default: 20 iterations shared among 20 VUs (maxDuration: 3m0s, gracefulStop: 30s)

time="2025-10-23T08:10:44+02:00" level=warning msg="Error from API server" error="listen tcp 127.0.0.1:6565: bind: address already in use"
time="2025-10-23T08:10:44+02:00" level=info msg="Starting test for tenant: amd" source=console
time="2025-10-23T08:10:45+02:00" level=info msg="Admin logged in successfully" source=console
time="2025-10-23T08:10:45+02:00" level=info msg="Found 50 users from CSV" source=console
time="2025-10-23T08:10:45+02:00" level=info msg="Creating project 1 of 20" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-23T08:10:45+02:00" level=info msg="Creating project 2 of 20" source=console
time="2025-10-23T08:10:45+02:00" level=info msg="Creating project 3 of 20" source=console
time="2025-10-23T08:10:45+02:00" level=info msg="Creating project 4 of 20" source=console
time="2025-10-23T08:10:45+02:00" level=info msg="Creating project 5 of 20" source=console
time="2025-10-23T08:10:45+02:00" level=info msg="Creating project 6 of 20" source=console
time="2025-10-23T08:10:45+02:00" level=info msg="Creating project 7 of 20" source=console
time="2025-10-23T08:10:46+02:00" level=info msg="Creating project 8 of 20" source=console
time="2025-10-23T08:10:46+02:00" level=info msg="Creating project 9 of 20" source=console
time="2025-10-23T08:10:46+02:00" level=info msg="Creating project 10 of 20" source=console
time="2025-10-23T08:10:46+02:00" level=info msg="Creating project 11 of 20" source=console
time="2025-10-23T08:10:46+02:00" level=info msg="Creating project 12 of 20" source=console
time="2025-10-23T08:10:46+02:00" level=info msg="Creating project 13 of 20" source=console
time="2025-10-23T08:10:46+02:00" level=info msg="Creating project 14 of 20" source=console
time="2025-10-23T08:10:46+02:00" level=info msg="Creating project 15 of 20" source=console
time="2025-10-23T08:10:46+02:00" level=info msg="Creating project 16 of 20" source=console
time="2025-10-23T08:10:46+02:00" level=info msg="Creating project 17 of 20" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-23T08:10:46+02:00" level=info msg="Creating project 18 of 20" source=console
time="2025-10-23T08:10:46+02:00" level=info msg="Creating project 19 of 20" source=console
time="2025-10-23T08:10:46+02:00" level=info msg="Creating project 20 of 20" source=console
time="2025-10-23T08:10:47+02:00" level=info msg="Created 20 projects" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-23T08:11:33+02:00" level=info msg="Logged in 50 users" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 20 processing project" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 14 processing project" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 6 processing project" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 7 processing project" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 19 processing project" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 16 processing project" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 11 processing project" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 12 processing project" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 2 processing project" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 4 processing project" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 18 processing project" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 3 processing project" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 17 processing project" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 10 processing project" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 9 processing project" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 13 processing project" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 1 processing project" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 8 processing project" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 5 processing project" source=console
time="2025-10-23T08:11:33+02:00" level=info msg="VU 15 processing project" source=console

running (0m49.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m00.3s/3m0s  00/20 shared iters

running (0m50.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m01.3s/3m0s  00/20 shared iters

running (0m51.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m02.3s/3m0s  00/20 shared iters

running (0m52.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m03.3s/3m0s  00/20 shared iters

running (0m53.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m04.3s/3m0s  00/20 shared iters

running (0m54.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m05.3s/3m0s  00/20 shared iters

running (0m55.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m06.3s/3m0s  00/20 shared iters

running (0m56.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m07.3s/3m0s  00/20 shared iters

running (0m57.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m08.3s/3m0s  00/20 shared iters

running (0m58.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m09.3s/3m0s  00/20 shared iters

running (0m59.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m10.3s/3m0s  00/20 shared iters

running (1m00.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m11.3s/3m0s  00/20 shared iters

running (1m01.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m12.3s/3m0s  00/20 shared iters

running (1m02.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m13.3s/3m0s  00/20 shared iters

running (1m03.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m14.3s/3m0s  00/20 shared iters

running (1m04.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m15.3s/3m0s  00/20 shared iters

running (1m05.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m16.3s/3m0s  00/20 shared iters

running (1m06.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m17.3s/3m0s  00/20 shared iters

running (1m07.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m18.3s/3m0s  00/20 shared iters

running (1m08.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m19.3s/3m0s  00/20 shared iters

running (1m09.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m20.3s/3m0s  00/20 shared iters

running (1m10.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m21.3s/3m0s  00/20 shared iters

running (1m11.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m22.3s/3m0s  00/20 shared iters

running (1m12.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m23.3s/3m0s  00/20 shared iters

running (1m13.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m24.3s/3m0s  00/20 shared iters

running (1m14.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m25.3s/3m0s  00/20 shared iters

running (1m15.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m26.3s/3m0s  00/20 shared iters

running (1m16.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m27.3s/3m0s  00/20 shared iters

running (1m17.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m28.3s/3m0s  00/20 shared iters

running (1m18.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m29.3s/3m0s  00/20 shared iters

running (1m19.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m30.3s/3m0s  00/20 shared iters

running (1m20.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m31.3s/3m0s  00/20 shared iters

running (1m21.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m32.3s/3m0s  00/20 shared iters

running (1m22.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m33.3s/3m0s  00/20 shared iters

running (1m23.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m34.3s/3m0s  00/20 shared iters

running (1m24.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m35.3s/3m0s  00/20 shared iters

running (1m25.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m36.3s/3m0s  00/20 shared iters

running (1m26.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m37.3s/3m0s  00/20 shared iters

running (1m27.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m38.3s/3m0s  00/20 shared iters

running (1m28.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m39.3s/3m0s  00/20 shared iters

running (1m29.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m40.3s/3m0s  00/20 shared iters

running (1m30.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m41.3s/3m0s  00/20 shared iters

running (1m31.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m42.3s/3m0s  00/20 shared iters

running (1m32.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m43.3s/3m0s  00/20 shared iters

running (1m33.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m44.3s/3m0s  00/20 shared iters

running (1m34.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m45.3s/3m0s  00/20 shared iters

running (1m35.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m46.3s/3m0s  00/20 shared iters

running (1m36.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m47.3s/3m0s  00/20 shared iters

running (1m37.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m48.3s/3m0s  00/20 shared iters

running (1m38.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m49.3s/3m0s  00/20 shared iters

running (1m39.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m50.3s/3m0s  00/20 shared iters

running (1m40.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m51.3s/3m0s  00/20 shared iters

running (1m41.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m52.3s/3m0s  00/20 shared iters

running (1m42.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m53.3s/3m0s  00/20 shared iters

running (1m43.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m54.3s/3m0s  00/20 shared iters

running (1m44.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m55.3s/3m0s  00/20 shared iters

running (1m45.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m56.3s/3m0s  00/20 shared iters

running (1m46.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m57.3s/3m0s  00/20 shared iters

running (1m47.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m58.3s/3m0s  00/20 shared iters

running (1m48.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m59.3s/3m0s  00/20 shared iters

running (1m49.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m00.3s/3m0s  00/20 shared iters

running (1m50.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m01.3s/3m0s  00/20 shared iters

running (1m51.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m02.3s/3m0s  00/20 shared iters

running (1m52.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m03.3s/3m0s  00/20 shared iters

running (1m53.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m04.3s/3m0s  00/20 shared iters

running (1m54.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m05.3s/3m0s  00/20 shared iters

running (1m55.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m06.3s/3m0s  00/20 shared iters

running (1m56.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m07.3s/3m0s  00/20 shared iters

running (1m57.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m08.3s/3m0s  00/20 shared iters

running (1m58.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m09.3s/3m0s  00/20 shared iters

running (1m59.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m10.3s/3m0s  00/20 shared iters

running (2m00.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m11.3s/3m0s  00/20 shared iters

running (2m01.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m12.3s/3m0s  00/20 shared iters

running (2m02.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m13.3s/3m0s  00/20 shared iters

running (2m03.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m14.3s/3m0s  00/20 shared iters

running (2m04.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m15.3s/3m0s  00/20 shared iters

running (2m05.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m16.3s/3m0s  00/20 shared iters

running (2m06.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m17.3s/3m0s  00/20 shared iters

running (2m07.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m18.3s/3m0s  00/20 shared iters

running (2m08.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m19.3s/3m0s  00/20 shared iters

running (2m09.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m20.3s/3m0s  00/20 shared iters

running (2m10.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m21.3s/3m0s  00/20 shared iters

running (2m11.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m22.3s/3m0s  00/20 shared iters

running (2m12.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m23.3s/3m0s  00/20 shared iters

running (2m13.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m24.3s/3m0s  00/20 shared iters

running (2m14.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m25.3s/3m0s  00/20 shared iters

running (2m15.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m26.3s/3m0s  00/20 shared iters

running (2m16.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m27.3s/3m0s  00/20 shared iters

running (2m17.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m28.3s/3m0s  00/20 shared iters

running (2m18.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m29.3s/3m0s  00/20 shared iters

running (2m19.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m30.3s/3m0s  00/20 shared iters

running (2m20.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m31.3s/3m0s  00/20 shared iters

running (2m21.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m32.3s/3m0s  00/20 shared iters

running (2m22.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m33.3s/3m0s  00/20 shared iters

running (2m23.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m34.3s/3m0s  00/20 shared iters

running (2m24.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m35.3s/3m0s  00/20 shared iters

running (2m25.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m36.3s/3m0s  00/20 shared iters

running (2m26.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m37.3s/3m0s  00/20 shared iters

running (2m27.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m38.3s/3m0s  00/20 shared iters

running (2m28.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m39.3s/3m0s  00/20 shared iters

running (2m29.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m40.3s/3m0s  00/20 shared iters

running (2m30.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m41.3s/3m0s  00/20 shared iters

running (2m31.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m42.3s/3m0s  00/20 shared iters

running (2m32.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m43.3s/3m0s  00/20 shared iters

running (2m33.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m44.3s/3m0s  00/20 shared iters

running (2m34.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m45.3s/3m0s  00/20 shared iters

running (2m35.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m46.3s/3m0s  00/20 shared iters

running (2m36.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m47.3s/3m0s  00/20 shared iters

running (2m37.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m48.3s/3m0s  00/20 shared iters

running (2m38.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m49.3s/3m0s  00/20 shared iters

running (2m39.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m50.3s/3m0s  00/20 shared iters

running (2m40.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m51.3s/3m0s  00/20 shared iters

running (2m41.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m52.3s/3m0s  00/20 shared iters

running (2m42.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m53.3s/3m0s  00/20 shared iters

running (2m43.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m54.3s/3m0s  00/20 shared iters

running (2m44.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m55.3s/3m0s  00/20 shared iters

running (2m45.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m56.3s/3m0s  00/20 shared iters

running (2m46.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m57.3s/3m0s  00/20 shared iters

running (2m47.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m58.3s/3m0s  00/20 shared iters

running (2m48.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  1m59.3s/3m0s  00/20 shared iters

running (2m49.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  2m00.3s/3m0s  00/20 shared iters

running (2m50.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  2m01.3s/3m0s  00/20 shared iters

running (2m51.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  2m02.3s/3m0s  00/20 shared iters

running (2m52.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  2m03.3s/3m0s  00/20 shared iters

running (2m53.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  2m04.3s/3m0s  00/20 shared iters
time="2025-10-23T08:13:37+02:00" level=info msg="Test completed" source=console


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(99)<1000' p(99)=1.36s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 3220    18.585232/s
    checks_succeeded...: 100.00% 3220 out of 3220
    checks_failed......: 0.00%   0 out of 3220

    ✓ sprint created successfully
    ✓ access granted successfully
    ✓ issue created successfully

    HTTP
    http_req_duration..............: avg=771.16ms min=34.86ms med=737.39ms max=4.02s p(90)=863.19ms p(95)=950.5ms
      { expected_response:true }...: avg=771.16ms min=34.86ms med=737.39ms max=4.02s p(90)=863.19ms p(95)=950.5ms
    http_req_failed................: 0.00%  0 out of 3291
    http_reqs......................: 3291   18.995031/s

    EXECUTION
    iteration_duration.............: avg=2m4s     min=2m4s    med=2m4s     max=2m4s  p(90)=2m4s     p(95)=2m4s   
    iterations.....................: 20     0.115436/s
    vus............................: 20     min=0         max=20
    vus_max........................: 20     min=20        max=20

    NETWORK
    data_received..................: 1.8 MB 10 kB/s
    data_sent......................: 1.8 MB 11 kB/s



running (2m53.3s), 00/20 VUs, 20 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  2m04.5s/3m0s  20/20 shared iters
time="2025-10-23T08:13:37+02:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"